# Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка с нечетными индексами.
# Пример: [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12


# my_list = input('введите список: ')

my_list = [2, 3, 5, 9, 3]

def SumNumbers(my_list): 
    sum = 0
    for i in range(len(my_list)):
    
        if i%2 != 0:
            sum = sum + my_list[i]
     
        
    return sum

print(SumNumbers(my_list))

#============================================================================================================

# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# [2, 3, 4, 5, 6] => [12, 15, 16]
# [2, 3, 5, 6] => [12, 15]

list = [2, 3, 4, 5, 6]
print(list)
my_list = []

for i in range(len(list)):

    my_list.append(list[0] * list[4])
    
    my_list.append(list[1] * list[3])
    
    my_list.append(list[2] * list[2])
    break

print(my_list)


#============================================================================================================

# Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов. (подробности в конце записи семинара).
# Пример: [1.1, 1.2, 3.1, 5, 10.01] => 0.19

list = [1.1, 1.2, 3.1, 5, 10.01]
my_list = []
for i in range(len(list)):
    my_list.append(list[i] - int(list[i]))
maxmin = max(my_list)-min(my_list)
maxmin = int (maxmin * 100)/100
print(maxmin)
#============================================================================================================

# Напишите программу, которая будет преобразовывать десятичное число в двоичное. Без применения встроеных методов (арифметически)
# Пример:
# 45 -> 101101
# 3 -> 11
# 2 -> 10

num = int (input('Введи число: '))
binary = ''
 
while num > 0:
    binary = str(num % 2) + binary
    num = num // 2

print(binary)

#============================================================================================================

# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов (Негафибоначчи).
# Пример: для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21]
#n = int (input('Введи число: '))

def fib(n):
    if n in [1,2]:
        return 1
    else:
        return fib(n-1) + fib(n-2)

my_list = []
for i in range(1,10):
    my_list.append(i)
    my_list.insert(0,-i)
print(my_list) 



